package App::Rasputine::Plugins::FrenchNotation;

use strict;
use warnings;
use base 'App::Rasputine::Plugin';
use Encode 'decode';
use encoding 'utf8';

our %chars = (
  'Ã¡' => 'a\'',
  'Ã©' => 'e\'',
  'Ã­' => 'i\'',
  'Ã³' => 'o\'',
  'Ãº' => 'u\'',
  'Ã ' => '\'a',
  'Ã¨' => '\'e',
  'Ã¬' => '\'i',
  'Ã²' => '\'o',
  'Ã¹' => '\'u',
  'Ã£' => 'a~',
  'Ãµ' => 'o~',
  'Ã¢' => 'a^',
  'Ãª' => 'e^',
  'Ã®' => 'i^',
  'Ã´' => 'o^',
  'Ã»' => 'u^',
  'Ã§' => 'c,',
  'Ã' => 'A\'',
  'Ã‰' => 'E\'',
  'Ã' => 'I\'',
  'Ã“' => 'O\'',
  'Ãš' => 'U\'',
  'Ã€' => '\'A',
  'Ãˆ' => '\'E',
  'ÃŒ' => '\'I',
  'Ã’' => '\'O',
  'Ã™' => '\'U',
  'Ãƒ' => 'A~',
  'Ã•' => 'O~',
  'Ã‚' => 'A^',
  'ÃŠ' => 'E^',
  'ÃŽ' => 'I^',
  'Ã”' => 'O^',
  'Ã›' => 'U^',
  'Ã‡' => 'C,',
  'à' => '\'a',
  'è' => '\'e', 
  'ì' => '\'i', 
  'ò' => '\'o', 
  'ù' => '\'u', 
  'á' => 'a\'', 
  'é' => 'b\'', 
  'í' => 'i\'',  
  'ó' => 'o\'', 
  'ú' => 'u\'', 
  'ç' => 'c,', 
  'ã' => 'a~', 
  'õ' => 'o~', 
  'â' => 'a^', 
  'ê' => 'e^', 
  'î' => 'i^', 
  'ô' => 'o^', 
  'û' => 'u^', 
  'À' => '\'A', 
  'È' => '\'E',
  'Ì' => '\'I',
  'Ò' => '\'O',
  'Ù' => '\'U',
  'Á' => 'A\'',
  'É' => 'E\'',
  'Í' => 'I\'',
  'Ó' => 'O\'',
  'Ú' => 'U\'',
  'Ç' => 'C,',
  'Ã' => 'A~',
  'Õ' => 'O~',
  'Â' => 'A^',
  'Ê' => 'E^',
  'Î' => 'I^',
  'Ô' => 'O^',
  'Û' => 'U^', 
);

our $match;

sub to_world {
  my ($self, $raw) = @_;
  
  if (!$match) {
    $match = join('', keys %chars);
    $match = qr/([$match])/o;
  }
  
  $raw = decode('utf8', $raw);
  $raw =~ s/$match/$chars{$1}/ge;
  
  return $raw;
}

1;
